from pyrogram.types import ReplyKeyboardMarkup


# ───────────────────────────────────────────────
# 🏠 HOME REPLY KEYBOARD (PRIVATE)
# ───────────────────────────────────────────────
def home_reply_kb():
    return ReplyKeyboardMarkup(
        [
            ["👥 Rᴇғᴇʀ & Eᴀʀɴ", "⭐ Wᴀʟʟᴇᴛ"],
            ["🎁 Dᴀɪʟʏ Bᴏɴᴜs", "📤 Wɪᴛʜᴅʀᴀᴡ"],
            ["🏆 Lᴇᴀᴅᴇʀʙᴏᴀʀᴅ"],
            ["📝 Fᴇᴇᴅʙᴀᴄᴋ", "📞 Sᴜᴘᴘᴏʀᴛ"],
        ],
        resize_keyboard=True,
        one_time_keyboard=False,
        selective=True,
    )